<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of DriveDX SMART monitoring and reporting tool. NOTE this download is from MacUpdate as Autopkg does not accept the Binary Fruit download url</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.download.DriveDX</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DriveDX</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://copy.com/web/users/user-14241273/copy/Ubertec%20Files/DriveDx.zip?revision=318</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
