<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple/DTD PLIST 1.0//EN" "http://apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest version of Uebersicht</string>
  <key>Identifier</key>
  <string>com.autopkg.ubertec.ubersicht.download</string>
  <key>Input</key>
  <dict>
    <key>DOWNLOAD_URL</key>
    <string>http://tracesof.net/uebersicht/</string>
    <key>DOWNLOAD_REGEX</key>
    <string>(?P&lt;url&gt;http://tracesof.net/uebersicht/releases/Uebersicht-(?P&lt;version&gt;.*).app.zip)</string>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
        <key>re_pattern</key>
        <string>%DOWNLOAD_REGEX%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict> 
</plist>
