<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <key>Description</key>
    <string>Downloads latest version of Uebersicht and imports into Munki</string>
    <key>Identifier</key>
    <string>com.autopkg.ubertec.Ubersicht.munki</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>Ubersicht</string>
      <key>NAME</key>
      <string>Ubersicht</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>category</key>
        <string>Utilities</string>
        <key>description</key>
        <string>Übersicht allows you to overlay HTML with CSS on your desktop using javascript or Coffee Script widgets</string>
        <key>display_name</key>
        <string>Übersicht</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.autopkg.ubertec.Ubersicht.download</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/extract</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_root</key>
          <string>%RECIPE_CACHE_DIR%/extract</string>
          <key>dmg_path</key>
          <string>%RECIPE_CACHE_DIR%/Uebersicht-%version%.dmg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>version</key>
            <string>%version%</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%dmg_path%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
