<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads AutoDMG 1.5.3 DMG. This will need to me modified with every release</string>
    <key>Identifier</key>
    <string>com.github.Ubertec.download.AutoDMG</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoDMG</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/MagerValp/AutoDMG/releases/download/v1.5.3/AutoDMG-1.5.3.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
